package rufaker

//FullName Полное имя (Фамилия Имя Отчество)
type FullName struct {
	firstName  string
	middleName string
	lastName   string
}

var firstNamesMale = []string{

	"Авдей", "Авксентий", "Агапит", "Агафон", "Акакий", "Александр", "Алексей", "Альберт", "Альвиан", "Анатолий", "Андрей", "Аникита", "Антон", "Антонин", "Анфим", "Аристарх", "Аркадий", "Арсений", "Артём", "Артур", "Архипп", "Афанасий",
	"Богдан", "Борис",
	"Вавила", "Вадим", "Валентин", "Валерий", "Валерьян", "Варлам", "Варсонофий", "Варфоломей", "Василий", "Венедикт", "Вениамин", "Викентий", "Виктор", "Виссарион", "Виталий", "Владимир", "Владислав", "Владлен", "Влас", "Всеволод", "Вячеслав",
	"Гавриил", "Галактион", "Геласий", "Геннадий", "Георгий", "Герасим", "Герман", "Германн", "Глеб", "Гордей", "Григорий",
	"Данакт", "Даниил", "Демид", "Демьян", "Денис", "Дмитрий", "Добрыня", "Донат", "Дорофей",
	"Евгений", "Евграф", "Евдоким", "Евсей", "Евстафий", "Егор", "Емельян", "Еремей", "Ермолай", "Ерофей", "Ефим", "Ефрем",
	"Ждан",
	"Зиновий",
	"Иакинф", "Иван", "Игнатий", "Игорь", "Изот", "Илья", "Иннокентий", "Ираклий", "Ириней", "Исидор", "Иуда", "Иулиан",
	"Капитон", "Ким", "Кир", "Кирилл", "Климент", "Кондрат", "Конон", "Константин", "Корнилий", "Кузьма", "Куприян",
	"Лаврентий", "Лев", "Леонид", "Леонтий", "Логгин", "Лука", "Лукий", "Лукьян",
	"Магистриан", "Макар", "Максим", "Мамонт", "Марк", "Мартын", "Матвей", "Мелентий", "Мина", "Мирон", "Мирослав", "Митрофан", "Михаил", "Мстислав",
	"Назар", "Нестор", "Никандр", "Никанор", "Никита", "Никифор", "Никодим", "Николай", "Никон",
	"Олег", "Онисим", "Онуфрий",
	"Павел", "Паисий", "Панкратий", "Пантелеймон", "Парфений", "Пафнутий", "Пахомий", "Пётр", "Платон", "Поликарп", "Порфирий", "Потап", "Пров", "Прокопий", "Протасий", "Прохор",
	"Разумник", "Родион", "Родослав", "Роман", "Ростислав", "Руслан",
	"Савва", "Савелий", "Самуил", "Святополк", "Святослав", "Севастьян", "Семён", "Серафим", "Сергей", "Сила", "Сильвестр", "Созон", "Софрон", "Спиридон", "Станислав", "Степан",
	"Тарас", "Тимофей", "Тимур", "Тит", "Тихон", "Трифон", "Трофим",
	"Урбан",
	"Фаддей", "Фёдор", "Федосей", "Федот", "Феликс", "Феоктист", "Филат", "Филимон", "Филипп", "Фирс", "Фока", "Фома", "Фотий", "Фрол",
	"Харитон", "Хрисанф", "Христофор",
	"Эдуард", "Эраст", "Юлиан", " Юрий", "Юстин",
	"Яков", "Якун", "Ярослав",
}

var firstNamesFemale = []string{
	"Агафья", "Аглая", "Агния", "Агриппина", "Аза", "Акулина", "Алевтина", "Александра", "Алина", "Алла", "Анастасия", "Ангелина", "Анжела", "Анжелика", "Анна", "Антонина", "Анфиса",
	"Валентина", "Валерия", "Варвара", "Василиса", "Вера", "Вероника", "Виктория",
	"Галина", "Глафира", "Гликерия",
	"Дана", "Дарья",
	"Евгения", "Евдокия", "Евлалия", "Евлампия", "Евпраксия", "Евфросиния", "Екатерина", "Елена", "Елизавета", "Епистима", "Ермиония",
	"Жанна",
	"Зинаида", "Злата", "Зоя",
	"Инга", "Инесса", "Инна", "Иоанна", "Ираида", "Ирина", "Ия",
	"Капитолина", "Карина", "Каролина", "Кира", "Клавдия", "Ксения",
	"Лада", "Лариса", "Лидия", "Лилия", "Любовь", "Людмила",
	"Маргарита", "Марина", "Мария", "Марфа", "Матрёна", "Милица", "Мирослава",
	"Надежда", "Наталья", "Нина", "Нонна",
	"Оксана", "Октябрина", "Олимпиада", "Ольга",
	"Павлина", "Пелагея", "Пинна", "Полина", "Прасковья",
	"Рада", "Раиса", "Римма",
	"Светлана", "Серафима", "Снежана", "София",
	"Таисия", "Тамара", "Татьяна",
	"Улита", "Ульяна", "Урсула",
	"Фаина", "Феврония", "Фёкла", "Феодора",
	"Целестина",
	"Юлия",
	"Яна", "Ярослава",
}

var firstNames = append(firstNamesMale, firstNamesFemale...)

var middleNamesMale = []string{
	"Абакумович", "Абрамович", "Абросимович", "Аввакумович", "Августович", "Авдеевич", "Авдиевич", "Авенирович", "Авериевич", "Аверкиевич", "Аверьянович", "Авксентиевич", "Авксентьевич", "Аврамович", "Агапович", "Агапиевич", "Агапьевич", "Агафонович", "Аггеевич", "Адамович", "Адрианович", "Азарович", "Азариевич", "Азарьевич", "Акимович", "Акинфович", "Акинфиевич", "Акинфьевич", "Аксёнович", "Аксентиевич", "Аксентьевич", "Александрович", "Алексеевич", "Альбертович", "Альфредович", "Амвросиевич", "Амвросьевич", "Амосович", "Ананиевич", "Ананьевич", "Анастасиевич", "Анастасьевич", "Анатолиевич", "Анатольевич", "Андреевич", "Андрианович", "Андронович", "Андрониевич", "Андроньевич", "Андроникович", "Аникеевич", "Аникиевич", "Анисиевич", "Анисьевич", "Анисимович", "Антипович", "Антипиевич", "Антипьевич", "Антонович", "Антонинович", "Антропович", "Антропиевич", "Антропьевич", "Ануфриевич", "Аполлинариевич", "Аполлинарьевич", "Аполлонович", "Ардалионович", "Ардальонович", "Арефович", "Арефиевич", "Арефьевич", "Аристархович", "Аркадиевич", "Аркадьевич", "Арнольдович", "Аронович", "Арсениевич", "Арсеньевич", "Арсентиевич", "Арсентьевич", "Артамонович", "Артёмович", "Артемиевич", "Артемьевич", "Артурович", "Архипович", "Аскольдович", "Афанасиевич", "Афанасьевич", "Афиногенович",
	"Бенедиктович", "Богданович", "Болеславович", "Болеславич", "Бонифатович", "Бонифатиевич", "Бонифатьевич", "Борисович", "Вавилич", "Вавилович", "Вадимович", "Валентинович", "Валерианович", "Валерьянович", "Валериевич", "Валерьевич", "Варламович", "Варламиевич", "Варламьевич", "Варсонофович", "Варсонофиевич", "Варсонофьевич", "Варфоломеевич", "Васильевич", "Велимирович", "Венедиктович", "Вениаминович", "Веньяминович", "Венцеславович", "Венцеславич", "Викентиевич", "Викентьевич", "Викторович", "Викториевич", "Викторинович", "Викулович", "Викулич", "Виленович", "Виленинович", "Вильгельмович", "Виссарионович", "Виталиевич", "Витальевич", "Витольдович", "Владиленович", "Владимирович", "Владиславович", "Владиславич", "Владленович", "Власович", "Власиевич", "Власьевич", "Вонифатович", "Вонифатиевич", "Вонифатьевич", "Всеволодович", "Вуколович", "Вячеславович", "Вячеславич",
	"Гавриилович", "Гаврилович", "Галактионович", "Гелиевич", "Геннадиевич", "Геннадьевич", "Генрихович", "Георгиевич", "Герасимович", "Германович", "Гермогенович", "Глебович", "Гордеевич", "Григорьевич", "Гуриевич", "Гурьевич",
	"Давидович", "Давыдович", "Даниилович", "Данилович", "Дементиевич", "Дементьевич", "Демидович", "Демьянович", "Денисович", "Денисиевич", "Денисьевич", "Димитриевич", "Диомидович", "Дионисиевич", "Дмитриевич", "Донатович", "Доримедонтович", "Дормедонтович", "Дормидонтович", "Дорофеевич",
	"Евгениевич", "Евгеньевич", "Евграфович", "Евграфьевич", "Евдокимович", "Евлампиевич", "Евлампьевич", "Евменович", "Евмениевич", "Евменьевич", "Евсеевич", "Евстафиевич", "Евстафьевич", "Евстахиевич", "Евстахьевич", "Евстигнеевич", "Евстратович", "Евстратиевич", "Евстратьевич", "Евтихиевич", "Евтихьевич", "Евфимиевич", "Евфимьевич", "Егорович", "Егориевич", "Егорьевич", "Елизарович", "Елисеевич", "Елистратович", "Емельянович", "Епифанович", "Епифаниевич", "Епифаньевич", "Еремеевич", "Ермилович", "Ермилич", "Ермильевич", "Ермолаевич", "Ерофеевич", "Ефимович", "Ефимиевич", "Ефимьевич", "Ефремович", "Ефремиевич", "Ефремьевич",
	"Захарович", "Захариевич", "Захарьевич", "Зенонович", "Зиновиевич", "Зиновьевич", "Зосимович", "Зосимич",
	"Иакимович", "Иакинфович", "Иванович", "Игнатович", "Игнатиевич", "Игнатьевич", "Игоревич", "Измаилович", "Измайлович", "Изосимович", "Изотович", "Иларионович", "Илиодорович", "Ильич", "Иннокентиевич", "Иннокентьевич", "Иоаннович", "Ионич", "Иосифович", "Ипатович", "ИпатиевичИпатьевич", "Ипполитович", "Исаакович", "Исаакиевич", "Исаевич", "Исакович", "Исакиевич", "Исидорович", "Иустинович",
	"Казимирович", "Каллиникович", "Каллистратович", "Капитонович", "Карлович", "Карпович", "Касьянович", "Кимович", "Киприанович", "Кириакович", "Кирьякович", "Кириллович", "Кирсанович", "Клавдиевич", "Климович", "Климентович", "Климентиевич", "Климентьевич", "Кондратович", "Кондратьевич", "Кононович", "Константинович", "Корнеевич", "Корнилович", "Корнилиевич", "Корнильевич", "Ксенофонтович", "Кузьмич", "Куприянович",
	"Лаврович", "Лаврентиевич", "Лаврентьевич", "Лазаревич", "Ларионович", "Львович", "Леонович", "Леонардович", "Леонидович", "Леонтиевич", "Леонтьевич", "Леопольдович", "Логвинович", "Лукич", "Лукьянович",
	"Маврикиевич", "Маврикьевич", "Маевич", "Макарович", "Макариевич", "Макарьевич", "Максимович", "Максимианович", "Максимилианович", "Максимильянович", "Мануилович", "Маркович", "Маркелович", "Марленович", "Мартимьянович", "Мартинович", "Мартинианович", "Мартынович", "Мартьянович", "Матвеевич", "Мелентиевич", "Мелентьевич", "Мелетиевич", "Мелетьевич", "Меркулович", "Меркуриевич", "Меркурьевич", "Мефодиевич", "Мефодьевич", "Милиевич", "Минич", "Минаевич", "Миронович", "Митрофанович", "Митрофаниевич", "Митрофаньевич", "Михаилович", "Михайлович", "Михеевич", "Модестович", "Моисеевич", "Мокеевич", "Мокиевич", "Мстиславович", "Мстиславич",
	"Назарович", "Назариевич", "Назарьевич", "Наркисович", "Наумович", "Нестерович", "Несторович", "Нефёдович", "Никандрович", "Никанорович", "Никитич", "Никифорович", "Никодимович", "Николаевич", "Никонович", "Нилович", "Нифонтович",
	"Олегович", "Олимпиевич", "Онисимович", "Онуфриевич", "Орестович", "Осипович", "Оскарович", "Остапович",
	"Павлович", "Павлинович", "Палладиевич", "Палладьевич", "Памфилович", "Памфильевич", "Панкратович", "Панкратиевич", "Панкратьевич", "Пантелеевич", "Пантелеймонович", "Панфилович", "Парамонович", "Парменович", "Пармёнович", "Парфёнович", "Парфениевич", "Парфеньевич", "Парфентьевич", "Патрикеевич", "Патрикиевич", "Пафнутиевич", "Пафнутьевич", "Пахомович", "Пахомиевич", "Пахомьевич", "Петрович", "Пименович", "Платонович", "Полиевктович", "Полиектович", "Поликарпович", "Поликарпиевич", "Поликарпьевич", "Порфирович", "Порфириевич", "Порфирьевич", "Потапович", "Прович", "Проклович", "Прокопович", "Прокопиевич", "Прокопьевич", "Прокофьевич", "Протасович", "Протасиевич", "Протасьевич", "Прохорович",
	"Радиевич", "Рафаилович", "Робертович", "Родионович", "Романович", "Ростиславович", "Ростиславич", "Рудольфович", "Рюрикович",
	"Саввич", "Савватеевич", "Савватиевич", "Савватьевич", "Савёлович", "Савелиевич", "Савельевич", "Самойлович", "Самсонович", "Самуилович", "Святославович", "Святославич", "Севастьянович", "Северьянович", "Селиванович", "Селивёрстович", "Селифанович", "Семёнович", "Серафимович", "Сергеевич", "Сидорович", "Силантиевич", "Силантьевич", "Сильвестрович", "Симонович", "Созонович", "Созонтович", "Созонтьевич", "Соломонович", "Софонович", "Софониевич", "Софоньевич", "Софронович", "Софрониевич", "Софроньевич", "Спиридонович", "Спиридониевич", "Спиридоньевич", "Станиславович", "Станиславич", "Степанович", "Сысоевич",
	"Тарасович", "Терентиевич", "Терентьевич", "Тимофеевич", "Тимурович", "Титович", "Тихонович", "Трифилиевич", "Трифильевич", "Трифонович", "Трофимович",
	"Ульянович", "Устинович",
	"Фадеевич", "Фёдорович", "Федосович", "Федосеевич", "Федотович", "Федотиевич", "Федотьевич", "Феликсович", "Феоктистович", "Феофанович", "Феофилович", "Феофилактович", "Ферапонтович", "Филаретович", "Филатович", "Филимонович", "Филипьевич", "Филиппович", "Фирсович", "Флегонтович", "Фокич", "Фомич", "Фотиевич", "Фотьевич", "Фридрихович", "Фролович",
	"Харитонович", "Харитониевич", "Харитоньевич", "Харламович", "Харлампович", "Харлампиевич", "Харлампьевич", "Хрисанфович", "Христофорович",
	"Эдуардович", "Эмилиевич", "Эмильевич", "Эммануилович", "Эрнестович",
	"Юлианович", "Юлиевич", "Юльевич", "Юрьевич",
	"Якимович", "Яковлевич", "Ярославович", "Ярославич",
}

var middleNamesFemale = []string{
	"Абакумовна", "Абрамовна", "Абросимовна", "Аввакумовна", "Августовна", "Авдеевна", "Авдиевна", "Авенировна", "Авериевна", "Аверкиевна", "Аверьяновна", "Авксентиевна", "Авксентьевна", "Аврамовна", "Агаповна", "Агапиевна", "Агапьевна", "Агафоновна", "Аггеевна", "Адамовна", "Адриановна", "Азаровна", "Азариевна", "Азарьевна", "Акимовна", "Акинфовна", "Акинфиевна", "Акинфьевна", "Аксёновна", "Аксентиевна", "Аксентьевна", "Александровна", "Алексеевна", "Альбертовна", "Альфредовна", "Амвросиевна", "Амвросьевна", "Амосовна", "Ананиевна", "Ананьевна", "Анастасиевна", "Анастасьевна", "Анатолиевна", "Анатольевна", "Андреевна", "Андриановна", "Андроновна", "Андрониевна", "Андроньевна", "Андрониковна", "Аникеевна", "Аникиевна", "Анисиевна", "Анисьевна", "Анисимовна", "Антиповна", "Антипиевна", "Антипьевна", "Антоновна", "Антониновна", "Антроповна", "Антропиевна", "Антропьевна", "Ануфриевна", "Аполлинариевна", "Аполлинарьевна", "Аполлоновна", "Ардалионовна", "Ардальоновна", "Арефовна", "Арефиевна", "Арефьевна", "Аристарховна", "Аркадиевна", "Аркадьевна", "Арнольдовна", "Ароновна", "Арсениевна", "Арсеньевна", "Арсентиевна", "Арсентьевна", "Артамоновна", "Артёмовна", "Артемиевна", "Артемьевна", "Артуровна", "Архиповна", "Аскольдовна", "Афанасиевна", "Афанасьевна", "Афиногеновна",
	"Бенедиктовна", "Богдановна", "Болеславовна", "Болеславна", "Бонифатовна", "Бонифатиевна", "Бонифатьевна", "Борисовна",
	"Вавилична", "Вавиловна", "Вадимовна", "Валентиновна", "Валериановна", "Валерьяновна", "Валериевна", "Валерьевна", "Варламовна", "Варламиевна", "Варламьевна", "Варсонофовна", "Варсонофиевна", "Варсонофьевна", "Варфоломеевна", "Васильевна", "Велимировна", "Венедиктовна", "Вениаминовна", "Веньяминовна", "Венцеславовна", "Венцеславна", "Викентиевна", "Викентьевна", "Викторовна", "Викториевна", "Викториновна", "Викуловна", "Викулична", "Виленовна", "Вилениновна", "Вильгельмовна", "Виссарионовна", "Виталиевна", "Витальевна", "Витольдовна", "Владиленовна", "Владимировна", "Владиславовна", "Владиславна", "Владленовна", "Власовна", "Власиевна", "Власьевна", "Вонифатовна", "Вонифатиевна", "Вонифатьевна", "Всеволодовна", "Вуколовна", "Вячеславовна", "Вячеславна",
	"Гаврииловна", "Гавриловна", "Галактионовна", "Гелиевна", "Геннадиевна", "Геннадьевна", "Генриховна", "Георгиевна", "Герасимовна", "Германовна", "Гермогеновна", "Глебовна", "Гордеевна", "Григорьевна", "Гуриевна", "Гурьевна",
	"Давидовна", "Давыдовна", "Данииловна", "Даниловна", "Дементиевна", "Дементьевна", "Демидовна", "Демьяновна", "Денисовна", "Денисиевна", "Денисьевна", "Димитриевна", "Диомидовна", "Дионисиевна", "Дмитриевна", "Донатовна", "Доримедонтовна", "Дормедонтовна", "Дормидонтовна", "Дорофеевна",
	"Евгениевна", "Евгеньевна", "Евграфовна", "Евграфьевна", "Евдокимовна", "Евлампиевна", "Евлампьевна", "Евменовна", "Евмениевна", "Евменьевна", "Евсеевна", "Евстафиевна", "Евстафьевна", "Евстахиевна", "Евстахьевна", "Евстигнеевна", "Евстратовна", "Евстратиевна", "Евстратьевна", "Евтихиевна", "Евтихьевна", "Евфимиевна", "Евфимьевна", "Егоровна", "Егориевна", "Егорьевна", "Елизаровна", "Елисеевна", "Елистратовна", "Емельяновна", "Епифановна", "Епифаниевна", "Епифаньевна", "Еремеевна", "Ермиловна", "Ермилична", "Ермильевна", "Ермолаевна", "Ерофеевна", "Ефимовна", "Ефимиевна", "Ефимьевна", "Ефремовна", "Ефремиевна", "Ефремьевна",
	"Захаровна", "Захариевна", "Захарьевна", "Зеноновна", "Зиновиевна", "Зиновьевна", "Зосимовна", "Зосимична",
	"Иакимовна", "Иакинфовна", "Ивановна", "Игнатовна", "Игнатиевна", "Игнатьевна", "Игоревна", "Измаиловна", "Измайловна", "Изосимовна", "Изотовна", "Иларионовна", "Илиодоровна", "Ильинична", "Иннокентиевна", "Иннокентьевна", "Иоанновна", "Ионична", "Иосифовна", "Ипатовна", "Ипатиевна", "Ипатьевна", "Ипполитовна", "Исааковна", "Исаакиевна", "Исаевна", "Исаковна", "Исакиевна", "Исидоровна", "Иустиновна",
	"Казимировна", "Каллиниковна", "Каллистратовна", "Капитоновна", "Карловна", "Карповна", "Касьяновна", "Кимовна", "Киприановна", "Кириаковна", "Кирьяковна", "Кирилловна", "Кирсановна", "Клавдиевна", "Климовна", "Климентовна", "Климентиевна", "Климентьевна", "Кондратовна", "Кондратьевна", "Кононовна", "Константиновна", "Корнеевна", "Корниловна", "Корнилиевна", "Корнильевна", "Ксенофонтовна", "Кузьминична", "Куприяновна",
	"Лавровна", "Лаврентиевна", "Лаврентьевна", "Лазаревна", "Ларионовна", "Львовна", "Леоновна", "Леонардовна", "Леонидовна", "Леонтиевна", "Леонтьевна", "Леопольдовна", "Логвиновна", "Лукинична", "Лукьяновна", "Маврикиевна", "Маврикьевна", "Маевна", "Макаровна", "Макариевна", "Макарьевна", "Максимовна", "Максимиановна", "Максимилиановна", "Максимильяновна", "Мануиловна", "Марковна", "Маркеловна", "Марленовна", "Мартимьяновна", "Мартиновна", "Мартиниановна", "Мартыновна", "Мартьяновна", "Матвеевна", "Мелентиевна", "Мелентьевна", "Мелетиевна", "Мелетьевна", "Меркуловна", "Меркуриевна", "Меркурьевна", "Мефодиевна", "Мефодьевна", "Милиевна", "Минична", "Минаевна", "Мироновна", "Митрофановна", "Митрофаниевна", "Митрофаньевна", "Михаиловна", "Михайловна", "Михеевна", "Модестовна", "Моисеевна", "Мокеевна", "Мокиевна", "Мстиславовна", "Мстиславна",
	"Назаровна", "Назариевна", "Назарьевна", "Наркисовна", "Наумовна", "Нестеровна", "Несторовна", "Нефёдовна", "Никандровна", "Никаноровна", "Никитична", "Никифоровна", "Никодимовна", "Николаевна", "Никоновна", "Ниловна", "Нифонтовна",
	"Олеговна", "Олимпиевна", "Онисимовна", "Онуфриевна", "Орестовна", "Осиповна", "Оскаровна", "Остаповна",
	"Павловна", "Павлиновна", "Палладиевна", "Палладьевна", "Памфиловна", "Памфильевна", "Панкратовна", "Панкратиевна", "Панкратьевна", "Пантелеевна", "Пантелеймоновна", "Панфиловна", "Парамоновна", "Парменовна", "Пармёновна", "Парфёновна", "Парфениевна", "Парфеньевна", "Парфентьевна", "Патрикеевна", "Патрикиевна", "Пафнутиевна", "Пафнутьевна", "Пахомовна", "Пахомиевна", "Пахомьевна", "Петровна", "Пименовна", "Платоновна", "Полиевктовна", "Полиектовна", "Поликарповна", "Поликарпиевна", "Поликарпьевна", "Порфировна", "Порфириевна", "Порфирьевна", "Потаповна", "Провна", "Прокловна", "Прокоповна", "Прокопиевна", "Прокопьевна", "Прокофьевна", "Протасовна", "Протасиевна", "Протасьевна", "Прохоровна", "Радиевна", "Рафаиловна", "Робертовна", "Родионовна", "Романовна", "Ростиславовна", "Ростиславна", "Рудольфовна", "Рюриковна",
	"Саввична", "Савватеевна", "Савватиевна", "Савватьевна", "Савёловна", "Савелиевна", "Савельевна", "Самойловна", "Самсоновна", "Самуиловна", "Святославовна", "Святославна", "Севастьяновна", "Северьяновна", "Селивановна", "Селивёрстовна", "Селифановна", "Семёновна", "Серафимовна", "Сергеевна", "Сидоровна", "Силантиевна", "Силантьевна", "Сильвестровна", "Симоновна", "Созоновна", "Созонтовна", "Созонтьевна", "Соломоновна", "Софоновна", "Софониевна", "Софоньевна", "Софроновна", "Софрониевна", "Софроньевна", "Спиридоновна", "Спиридониевна", "Спиридоньевна", "Станиславовна", "Станиславна", "Степановна", "Сысоевна", "Тарасовна",
	"Терентиевна", "Терентьевна", "Тимофеевна", "Тимуровна", "Титовна", "Тихоновна", "Трифилиевна", "Трифильевна", "Трифоновна", "Трофимовна",
	"Ульяновна", "Устиновна",
	"Фадеевна", "Фёдоровна", "Федосовна", "Федосеевна", "Федотовна", "Федотиевна", "Федотьевна", "Феликсовна", "Феоктистовна", "Феофановна", "Феофиловна", "Феофилактовна", "Ферапонтовна", "Филаретовна", "Филатовна", "Филимоновна", "Филипьевна", "Филипповна", "Фирсовна", "Флегонтовна", "Фокична", "Фоминична", "Фотиевна", "Фотьевна", "Фридриховна", "Фроловна",
	"Харитоновна", "Харитониевна", "Харитоньевна", "Харламовна", "Харламповна", "Харлампиевна", "Харлампьевна", "Хрисанфовна", "Христофоровна",
	"Эдуардовна", "Эмилиевна", "Эмильевна", "Эммануиловна", "Эрнестовна",
	"Юлиановна", "Юлиевна", "Юльевна", "Юрьевна",
	"Якимовна", "Яковлевна", "Ярославовна", "Ярославна",
}

var middleNames = append(middleNamesMale, middleNamesFemale...)

var lastName = []string{
	"Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Петров", "Лебедев", "Козлов", "Новиков", "Морозов", "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Виноградов", "Богданов", "Воробьёв", "Фёдоров", "Михайлов", "Беляев", "Сидоров", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов", "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королёв", "Денисов", "Пономарёв", "Григорьев", "Лазарев", "Медведев",
	"Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв", "Николаев", "Крылов", "Максимов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов", "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Тарасов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов", "Шестаков", "Казаков", "Ефимов", "Громов", "Герасимов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников", "Карпов", "Афанасьев", "Власов", "Маслов", "Исаков",
	"Тихонов", "Аксёнов", "Гаврилов", "Родионов", "Котов", "Горбунов", "Кудряшов", "Быков", "Зуев", "Третьяков", "Савельев", "Панов", "Рыбаков", "Суворов", "Абрамов", "Воронов", "Мухин", "Архипов", "Трофимов", "Мартынов", "Емельянов", "Горшков", "Чернов", "Овчинников", "Голубев", "Селезнёв", "Панфилов", "Копылов", "Михеев", "Галкин", "Назаров", "Лобанов", "Лукин", "Беляков", "Потапов", "Некрасов", "Хохлов", "Жданов", "Наумов", "Шилов", "Воронцов", "Ермаков", "Дроздов", "Игнатьев", "Савин", "Логинов", "Сафонов", "Капустин", "Кириллов", "Моисеев", "Елисеев", "Кошелев", "Костин", "Горбачёв",
	"Орехов", "Ефремов", "Исаев", "Евдокимов", "Калашников", "Кабанов", "Носков", "Юдин", "Кулагин", "Лапин", "Прохоров", "Нестеров", "Харитонов", "Агафонов", "Муравьёв", "Ларионов", "Федосеев", "Зимин", "Пахомов", "Шубин", "Игнатов", "Филатов", "Крюков", "Рогов", "Кулаков", "Терентьев", "Молчанов", "Владимиров", "Артемьев", "Гурьев", "Зиновьев", "Гришин", "Кононов", "Дементьев", "Ситников", "Симонов", "Мишин", "Фадеев", "Комиссаров", "Мамонтов", "Носов", "Гуляев", "Шаров", "Устинов", "Вишняков", "Евсеев", "Лаврентьев", "Брагин", "Константинов", "Корнилов", "Авдеев", "Зыков",
	"Бирюков", "Шарапов", "Никонов", "Щукин", "Осипов", "Дьячков", "Одинцов", "Сазонов", "Якушев", "Красильников", "Гордеев", "Самойлов", "Князев", "Беспалов", "Уваров", "Шашков", "Бобылёв", "Доронин", "Белозёров", "Рожков", "Самсонов", "Мясников", "Лихачёв", "Буров", "Сысоев", "Фомичёв", "Русаков", "Стрелков", "Гущин", "Тетерин", "Колобов", "Субботин", "Фокин", "Блохин", "Селиверстов", "Пестов", "Кондратьев", "Силин", "Меркушев", "Лыткин", "Туров",
}

var genders = []string{"Мужской", "Женский"}

// FirstNameMale Мужское имя
func FirstNameMale() string {
	return randomElementFromSliceString(firstNamesMale)
}

// FirstNameFemale Женское имя
func FirstNameFemale() string {
	return randomElementFromSliceString(firstNamesFemale)
}

// MiddleNameMale Мужское отчество
func MiddleNameMale() string {
	return randomElementFromSliceString(middleNamesMale)
}

// MiddleNameFemale Женское отчество
func MiddleNameFemale() string {
	return randomElementFromSliceString(middleNamesFemale)
}

// LastNameMale Мужская фамилия
func LastNameMale() string {
	return randomElementFromSliceString(lastName)
}

// LastNameFemale Женская фамилия
func LastNameFemale() string {
	return randomElementFromSliceString(lastName) + "а"
}

// FullNameMale Мужские ФИО
func FullNameMale() FullName {
	return FullName{
		firstName:  FirstNameMale(),
		middleName: MiddleNameMale(),
		lastName:   LastNameMale(),
	}
}

// FullNameFemale Женские ФИО
func FullNameFemale() FullName {
	return FullName{
		firstName:  FirstNameFemale(),
		middleName: MiddleNameFemale(),
		lastName:   LastNameFemale(),
	}
}

// FirstName Случайное имя
func FirstName() string {
	return randomElementFromSliceString(firstNames)
}

// MiddleName Случайное отчество
func MiddleName() string {
	return randomElementFromSliceString(middleNames)
}

// LastName Случайная фамилия
func LastName() string {
	if randomBoolean() {
		return LastNameMale()
	}

	return LastNameFemale()
}

// RandomFullName Случайные ФИО, мужское/женское
func RandomFullName() FullName {

	if randomBoolean() {
		return FullNameMale()
	}
	return FullNameFemale()
}

// Gender Случайны пол
func Gender() string {
	return randomElementFromSliceString(genders)
}
